# Predicting House Prices in the Philippines

## Dataset:

Housing Prices Dataset - Philippines - Jandrik Luna

Source: https://www.kaggle.com/datasets/linkanjarad/housing-prices-dataset-philippines

## Import Libraries

In [79]:
import numpy as np
import pandas as pd

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.linear_model import LinearRegression
from sklearn.metrics import accuracy_score

## Set Global Variables

In [80]:
path1 = './dataset/Housing Prices Philippines Lamudi.csv'
path2 = './dataset/Housing Prices Imputed.csv'

## Import dataset

In [81]:
dataset = pd.read_csv(path1)

dataset.tail()

      Unnamed: 0  ...       Price
2994        2994  ...  16000000.0
2995        2995  ...  85000000.0
2996        2996  ...   2844000.0
2997        2997  ...   7676915.0
2998        2998  ...   2650000.0

[5 rows x 12 columns]

## Keep Relevant Features

In [82]:
dataset = dataset[[
    'Bathrooms',
    'Bedrooms',
    'Car Spaces',
    'Floor area (m²)',
    'Land Size (m²)',
    'Price'
]]

dataset.tail()

      Bathrooms  Bedrooms  ...  Land Size (m²)       Price
2994        4.0       5.0  ...           300.0  16000000.0
2995        4.0       4.0  ...          1056.0  85000000.0
2996        1.0       2.0  ...           169.0   2844000.0
2997        3.0       4.0  ...           217.0   7676915.0
2998        1.0       3.0  ...            72.0   2650000.0

[5 rows x 6 columns]

## Inspect Dataset

In [83]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bathrooms        2238 non-null   float64
 1   Bedrooms         2275 non-null   float64
 2   Car Spaces       1211 non-null   float64
 3   Floor area (m²)  2917 non-null   float64
 4   Land Size (m²)   2844 non-null   float64
 5   Price            2924 non-null   float64
dtypes: float64(6)
memory usage: 140.7 KB

In [84]:
dataset.dtypes

Bathrooms          float64
Bedrooms           float64
Car Spaces         float64
Floor area (m²)    float64
Land Size (m²)     float64
Price              float64
dtype: object

In [85]:
dataset.shape

(2999, 6)

In [86]:
dataset.isna().sum()

Bathrooms           761
Bedrooms            724
Car Spaces         1788
Floor area (m²)      82
Land Size (m²)      155
Price                75
dtype: int64

## Impute missing data

## Split data into input and output

In [89]:
X = dataset.drop('Price', axis=1).values
y = dataset['Price'].values